///////////////////////////////////////////////////////////////////////////////////////////////////
// Данная программа решает следующие задачи:
// 1. Считает число чисел с различными цифрами в десятичной системе счисления
// 2. Проверяет, что в числе все цифры различны
// 3. Отрабатывает механизм определения следующего такого числа
// 4. Выводит все такие числа в файл, совместимый с форматом c++
///////////////////////////////////////////////////////////////////////////////////////////////////

#include <cstdio>

///////////////////////////////////////////////////////////////////////////////////////////////////
// Функция считает количество таких чисел
///////////////////////////////////////////////////////////////////////////////////////////////////
long long number() {
    // \sum\limits_{k=1}^10 \frac{9 \cdot 9!}{(10 - k)!} \approx [9 \cdot 9! e - 1 + 2/90]
    // 9*(1 + 9 + 9*8 + 9*8*7 + ... + 9*8*7*...*2 + 9*8*7*...*1)
    long long r = 0;
    long long s = 1;
    for (int i = 9; i>=0; i--) {
        r += s;
        s *= i;
        printf("%d %d %d\n", i, r, s);
    }
    return 9*r;
}

///////////////////////////////////////////////////////////////////////////////////////////////////
// Функция проверяет, что в числе все цифры разные
///////////////////////////////////////////////////////////////////////////////////////////////////
bool check(long long n) {
    int a[100];
    int ndigits = 0;
    while (n > 0) {
        int s = n % 10;
        for (int i = 0; i<ndigits; i++) {
            if (s == a[i]) {
                return false;
            }
        }
        a[ndigits] = s;
        ndigits++;
        n /= 10;
    }
    return true;
}

///////////////////////////////////////////////////////////////////////////////////////////////////
// Функция ищет следующее такое число
///////////////////////////////////////////////////////////////////////////////////////////////////
long long next(long long value) {
    value++;
    if (value > 9876543210) {
        return -1;
    }
    while (!check(value)) {
        value++;
    }
    return value;
}

///////////////////////////////////////////////////////////////////////////////////////////////////
// Функция выводит все числа в файл
///////////////////////////////////////////////////////////////////////////////////////////////////
void all_numbers() {
    FILE* f;
    f = fopen("diff_numbers.h", "w");
    if (f == NULL) {
        return;
    }
    fprintf(f, "long long diff_numbers[%lld] = {\n", number());
    long long value = 1;
    while (value < 9876543210) {
        fprintf(f, "    %lld,\n", value);
        value = next(value);
    }
    fprintf(f, "    9876543210\n};\n");
    fclose(f);
}

///////////////////////////////////////////////////////////////////////////////////////////////////
// Точка входа
///////////////////////////////////////////////////////////////////////////////////////////////////
int main() {
    printf("Number of such numbers: %d\n", number());
    long long checked[10] = {
        123456,
        1234567890,
        9876543210,
        100,
        9999999999,
        99999999999,
        1231,
        1234567891,
        542,
        444
    };
    for (int i = 0; i<10; i++) {
        printf("Check number %lld: %lld\n", checked[i], check(checked[i]));
    }
    for (int i = 0; i<10; i++) {
        printf("Next number %lld: %lld\n", checked[i], next(checked[i]));
    }
    // Вывод в текстовый файл даёт файл размером 135 МБ, что слишком много
    // Также метод перебора требует много времени
    //all_numbers();
    return 0;
}